[
    {
        "name": "Encode Thoughts",
        "school": "Enchantment",
        "level": 0,
        "range": "",
        "aoe": "",
        "duration": "8 hours",
        "concentration": false,
        "ritual": false,
        "components": [],
        "cast_time": "Action",
        "short": "",
        "dmg_type": "",
        "spell_type": "",
        "plus_slot": "",
        "cantrip_upgrade": [
            {
                "level": 5,
                "dmg": ""
            },
            {
                "level": 11,
                "dmg": ""
            },
            {
                "level": 17,
                "dmg": ""
            }
        ],
        "full": [
            "Putting a finger to your head, you pull a memory, an idea, or a message from your mind and transform it into a tangible string of glowing energy called a thought strand, which persists for the duration or until you cast this spell again. The thought strand appears in an unoccupied space within 5 feet of you as a Tiny, weightless, semisolid object that can be held and carried like a ribbon. It is otherwise stationary.",
            "If you cast this spell while concentrating on a spell or an ability that allows you to read or manipulate the thoughts of others (such as detect thoughts or modify memory), you can transform the thoughts or memories you read, rather than your own, into a thought strand.",
            "Casting this spell while holding a thought strand allows you to instantly receive whatever memory, idea, or message the thought strand contains. (Casting detect thoughts on the strand has the same effect.)"
        ],
        "classes": [],
        "subclass": []
    },
    {
        "name": "Friends",
        "school": "Enchantment",
        "level": 0,
        "range": "10ft",
        "aoe": "",
        "duration": "1min",
        "concentration": true,
        "ritual": false,
        "components": ["S", "M"],
        "cast_time": "Action",
        "short": "",
        "dmg_type": "",
        "spell_type": "",
        "plus_slot": "",
        "cantrip_upgrade": [
            {
                "level": 5,
                "dmg": ""
            },
            {
                "level": 11,
                "dmg": ""
            },
            {
                "level": 17,
                "dmg": ""
            }
        ],
        "full": [
            "You magically emanate a sense of friendship toward one creature you can see within range. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target succeeds automatically if it isn't a Humanoid, if you're fighting it, or if you have cast this spell on it within the past 24 hours.",
            "The spell ends early if the target takes damage or if you make an attack roll, deal damage, or force anyone to make a saving throw. When the spell ends, the target knows it was Charmed by you."
        ],
        "classes": ["Bard", "Sorcerer", "Warlock", "Wizard"],
        "subclass": [
            "Arcana Cleric",
            "Arcane Trickster Rogue",
            "Lore Bard",
            "Eldritch Knight Fighter"
        ]
    }
]
